src/Documents/СборкаБукета/СборкаБукета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СборкаБукета</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Букет</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сборщик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставБукета</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СборкаБукета/Forms/ФормаДокумента/Module.bsl
//себестоимость считать как среднюю стоимость этого товара, а не как розничную цену.


&НаКлиенте
Процедура ОбновитьСумму(СтрокаТабличнойчасти)
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Стоимость;
	СебестоимостьБукета = 0;
	Для каждого СтрокаТаблицы Из Объект.СоставБукета Цикл
		СебестоимостьБукета = СебестоимостьБукета + СтрокаТаблицы.Сумма;
	КонецЦикла;
	Объект.Себестоимость = СебестоимостьБукета;
Конецпроцедуры

&НаКлиенте
Процедура СоставБукетаНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставБукета.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоимость = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	ОбновитьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставБукетаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставБукета.ТекущиеДанные;
	Обновитьсумму(СтрокаТабличнойЧасти);
КонецПроцедуры
